{
  "poems": [
    {
      "signature": "Christmas Eve: My Mother Dressing by Toi Derricotte",
      "image": "https://www.wfla.com/wp-content/uploads/sites/71/2023/03/everything-you-need-to-make-a-puppy-starter-kit.jpg?w=1280",
      "poemtxt": "My mother was not impressed with her beauty;\nonce a year she put it on like a costume,\nplaited her black hair, slick as cornsilk, down past her hips,\nin one rope-thick braid, turned it, carefully, hand over hand,\nand fixed it at the nape of her neck, stiff and elegant as a crown,\nwith tortoise pins, like huge insects,\nsome belonging to her dead mother,\nsome to my living grandmother.\nSitting on the stool at the mirror,\nshe applied a peachy foundation that seemed to hold her down, to trap her,\nas if we never would have noticed what flew among us unless it was weighted and bound in its mask.\nVaseline shined her eyebrows,\nmascara blackened her lashes until they swept down like feathers;\nher eyes deepened until they shone from far away.\n\nNow I remember her hands, her poor hands, which, even then were old from scrubbing,\nwhiter on the inside than they should have been,\nand hard, the first joints of her fingers, little fattened pads,\nthe nails filed to sharp points like old-fashioned ink pens,\npainted a jolly color.\nHer hands stood next to her face and wanted to be put away, prayed\nfor the scrub bucket and brush to make them useful.\nAnd, as I write, I forget the years I watched her\npull hairs like a witch from her chin, magnify\nevery blotch—as if acid were thrown from the inside.\n\nBut once a year my mother\nrose in her white silk slip,\nnot the slave of the house, the woman,\ntook the ironed dress from the hanger—\nallowing me to stand on the bed, so that\nmy face looked directly into her face,\nand hold the garment away from her\nas she pulled it down.",
      "id": 164
    },
    {
      "signature": "The Weakness by Toi Derricotte",
      "image": "",
      "poemtxt": "That time my grandmother dragged me\nthrough the perfume aisles at Saks, she held me up\nby my arm, hissing, “Stand up,”\nthrough clenched teeth, her eyes\nbright as a dog’s\ncornered in the light.\nShe said it over and over,\nas if she were Jesus,\nand I were dead. She had been\nsolid as a tree,\na fur around her neck, a\nlight-skinned matron whose car was parked, who walked on swirling\nmarble and passed through\nbrass openings—in 1945.\nThere was not even a black\nelevator operator at Saks.\nThe saleswoman had brought velvet\nleggings to lace me in, and cooed,\nas if in the service of all grandmothers.\nMy grandmother had smiled, but not\nhungrily, not like my mother\nwho hated them, but wanted to please,\nand they had smiled back, as if\nthey were wearing wooden collars.\nWhen my legs gave out, my grandmother\ndragged me up and held me like God\nholds saints by the\nroots of the hair. I begged her\nto believe I couldn’t help it. Stumbling,\nher face white\nwith sweat, she pushed me through the crowd, rushing\naway from those eyes\nthat saw through\nher clothes, under\nher skin, all the way down\nto the transparent\ngenes confessing.",
      "id": 165
    },
    {
      "signature": "Audre's Apples by Assotto Saint",
      "image": "https://cdn.britannica.com/22/187222-050-07B17FB6/apples-on-a-tree-branch.jpg",
      "poemtxt": "For audre lorde\n\nas i swallow\nthe last morsel of a little green apple\nblessed with myrrhed prayers & libations on an african altar\n\nin a gothic cathedral\nwhere with banners from all corners of our country\nfreed from the prejudice of a dozen years’ politics of greed\n\nthousands gather on king’s day\nto ground sorrow at a sister’s recent passing\n(lorde we testify)\ndrum up her spirit along a cascading rainbow\nto the orishas’ paradise\n\nthe juice snakes sweetly down my throat & circles my veins\nit loosens my tingling toes stiffened\nby neuropathy\n\narmed only with a white candle that flares its last flames\ni march out into the dark hell of\nour big apple",
      "id": 166
    },
    {
      "signature": "The Geography of Poetry by Assotto Saint",
      "image": "",
      "poemtxt": "For Ntozake Shange\n\nntozake shange\ni looked you up\namong the poets at barnes & noble\nbut i didn’t find you\n\nwalt was there amidst leaves of grass\nanne gazed down\nher glazed eyes dreamt of rowing mercy\nerica posed in her latest erotica\neven rod took much space\ni searched among ghosts\n& those alive\nstill\ni couldn’t find you\n\ni asked the clerk\nif he had kept you tied down in boxes\nor does he use your books as dart boards\nhe smirked then shouted “she’s in the black section\nin the back”\neven literature has its ghettos\n\nstacked amongst langston, nikki, & countee\nmaya who looked mad\nthe blues had her bad\nzake tell me\ndid you demand to be segregated\n“does color modify poetry”\ni asked the manager\n\nhe patted me on my head\nwhispered\n“it’s always been this way”",
      "id": 167
    },
    {
      "signature": "'My own heart let me more have pity on' by Gerard Manley Hopkins",
      "image": "",
      "poemtxt": "My own heart let me more have pity on; let\nMe live to my sad self hereafter kind,\nCharitable; not live this tormented mind\nWith this tormented mind tormenting yet.\nI cast for comfort I can no more get\nBy groping round my comfortless, than blind\nEyes in their dark can day or thirst can find\nThirst's all-in-all in all a world of wet.\n\nSoul, self; come, poor Jackself, I do advise\nYou, jaded, let be; call off thoughts awhile\nElsewhere; leave comfort root-room; let joy size\nAt God knows when to God knows what; whose smile\n's not wrung, see you; unforeseen times rather — as skies\nBetweenpie mountains — lights a lovely mile.",
      "id": 168
    },
    {
      "signature": "the mother by Gwendolyn Brooks",
      "image": "",
      "poemtxt": "Abortions will not let you forget.\nYou remember the children you got that you did not get,   \nThe damp small pulps with a little or with no hair,   \nThe singers and workers that never handled the air.   \nYou will never neglect or beat\nThem, or silence or buy with a sweet.\nYou will never wind up the sucking-thumb\nOr scuttle off ghosts that come.\nYou will never leave them, controlling your luscious sigh,   \nReturn for a snack of them, with gobbling mother-eye.\n\nI have heard in the voices of the wind the voices of my dim killed children.\nI have contracted. I have eased\nMy dim dears at the breasts they could never suck.\nI have said, Sweets, if I sinned, if I seized\nYour luck\nAnd your lives from your unfinished reach,\nIf I stole your births and your names,\nYour straight baby tears and your games,\nYour stilted or lovely loves, your tumults, your marriages, aches, and your deaths,\nIf I poisoned the beginnings of your breaths,\nBelieve that even in my deliberateness I was not deliberate.   \nThough why should I whine,\nWhine that the crime was other than mine?—\nSince anyhow you are dead.\nOr rather, or instead,\nYou were never made.\nBut that too, I am afraid,\nIs faulty: oh, what shall I say, how is the truth to be said?   \nYou were born, you had body, you died.\nIt is just that you never giggled or planned or cried.\n\nBelieve me, I loved you all.\nBelieve me, I knew you, though faintly, and I loved, I loved you\nAll.",
      "id": 169
    },
    {
      "signature": "Black Oval Shapes by Tomaz Salamun",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTVFngrh26ex2iI_ZS1NaMKA5V-1FniYKRtDA&usqp=CAU",
      "poemtxt": "I’m bareheeled and also not bareheeled,\nI see the whiteness of the church wall.\nIgnore the gentleman with the hat, the gentleman with\nthe hat turns into death.\nThe gentleman also gargles.\nHe grinds his eyes\nand arranges them. The apricots remain\nin his palms. Would we try to order\nsomething? If gasoline is spilled only on\nthe windbreaker, does only the windbreaker burn?",
      "id": 170
    },
    {
      "signature": "“Lucretius grabbed my arm and led me” by Tomaz Salamun",
      "image": "",
      "poemtxt": "Lucretius grabbed my arm and led me\nto the spot where he went nuts. I watered little\ndrums right away and entangled the Sava River\nwith knitting needles. I putrefied a small soup,\ndismembered seven towels. There, He — The\nTerrible — burnt on the stake, squatted, too.\nMy god, I beat him up his ass. Puff, puff, but\nno one had heard a thing. Now here, I’m flooded\nwith flowers by cumin. Even Tarkovsky appears.\nNow I will suck you with my thumbs, mold\nyou like clay with my horns, till he’d vaporize and\nsee into what and where I’ve traveled to. Into\nhonor. Into white birch trees. Into the pouch\nused for bread. I hung around the world a lot,\nfrothily crushing the mountain range. With no\navail, with no day’s pay, sticky are my laws.\nI protected an elephant as much as I could,\nstared at the back of the horse. Joshed the others\nnow, too, tested spring mattresses. Kept\ngulping nirvana. Loosened feathery leaves,\nwrapped the emperor into a roll. To not let my\nsenses perish, to gallop without a break.",
      "id": 171
    },
    {
      "signature": "To Daffodils by Robert Herrick",
      "image": "",
      "poemtxt": "Fair Daffodils, we weep to see\nYou haste away so soon;\nAs yet the early-rising sun\nHas not attain'd his noon.\nStay, stay,\nUntil the hasting day\nHas run\nBut to the even-song;\nAnd, having pray'd together, we\nWill go with you along.\n\nWe have short time to stay, as you,\nWe have as short a spring;\nAs quick a growth to meet decay,\nAs you, or anything.\nWe die\nAs your hours do, and dry\nAway,\nLike to the summer's rain;\nOr as the pearls of morning's dew,\nNe'er to be found again.",
      "id": 172
    },
    {
      "signature": "The Argument of his Book BY ROBERT HERRICK",
      "image": "",
      "poemtxt": "I sing of brooks, of blossoms, birds, and bowers,\nOf April, May, of June, and July flowers.\nI sing of May-poles, hock-carts, wassails, wakes,\nOf bridegrooms, brides, and of their bridal-cakes.\nI write of youth, of love, and have access\nBy these to sing of cleanly wantonness.\nI sing of dews, of rains, and piece by piece\nOf balm, of oil, of spice, and ambergris.\nI sing of Time's trans-shifting; and I write\nHow roses first came red, and lilies white.\nI write of groves, of twilights, and I sing\nThe court of Mab, and of the fairy king.\nI write of Hell; I sing (and ever shall)\nOf Heaven, and hope to have it after all.",
      "id": 173
    },
    {
      "signature": "In the Season of Pink Ladies by Sayuri Ayers",
      "image": "",
      "poemtxt": "After Honeycrisp and Winesap have fallen,\nanother season begins. The orchard glistens\nadorned in rose-gold fruit. Branches creak,\nmusic of surrender.\n\nOn tiptoe my son shakes gnarled limbs\nbringing a shower of blushing apples.\nHe gifts me the pretty one laced\nwith wormholes. He runs ahead,\n\nslipping from me. As his shadow lengthens,\nanother season begins. The orchard glistens.\nMy son crushes fruit underfoot, their splitting,\nmusic of surrender.",
      "id": 174
    },
    {
      "signature": "The Black Finger BY ANGELINA WELD GRIMKÉ",
      "image": "",
      "poemtxt": "I have just seen a most beautiful thing\n      Slim and still\nAgainst a gold, gold sky,\nA straight black cypress,\n      Sensitive,\n      Exquisite,\n      A black finger\n      Pointing upwards.\nWhy, beautiful still finger, are you black?\nAnd why arc you pointing upwards?",
      "id": 175
    }
  ]
}